package org.example;

/**
 * Model
 * 무엇을 할지 정의
 * 데이터 또는 비즈니스 로직
 * View와 Contorller에 대해 아무것도 모르고 있어야 함.
 * Domain이라고도 함
 */
public class NumberBaseball {
    // 컴퓨터가 임의의 수 세 개를 뽑는다.
    // 플레이어가 임의의 수 세 개를 뽑는다.
    // 컴퓨터가 자신의 숫자와 플레이어의 숫자를 비교한다.
    // 컴퓨터가 비교한 결과를 가지고 화면에 포볼,볼,스트라이크를 출력한다.
    // 다 맞출때(3스트라이크)까지 반복한다.
    // 3스트라이크가 되면 반복이 끝나고 컴퓨터가 "3개의 숫자를 모두 맞히셨습니다! 게임 종료"를 출력한다.
    // 컴퓨터가 "게임을 새로 시작하려면 1, 종료하려면 2를 입력하세요."를 출력한다.
    // 플레이어가 1을 입력하면 처음부터 다시 시작한다.
    // 플레이어가 2를 입력하면 완전히 종료된다.
}
